Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.3.56/Microchip.SAMD20_DFP.pdsc
         <device Dname="ATSAMD20G16B">
            <processor Dcore="Cortex-M0+" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <compile header="samd20b/include/sam.h" define="__SAMD20G16B__"/>
            <debug svd="samd20b/svd/ATSAMD20G16B.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x10000" default="1" startup="1"/>
            <memory id="IRAM1" start="0x20000000" size="0x2000" default="1"/>
            <algorithm name="samd20b/keil/Flash/ATSAMD20_64.FLM" start="0x00000000" size="0x00010000" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="samd20b/atdf/ATSAMD20G16B.atdf"/>
                  <at:variant ordercode="SAMD20G16B-MU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAMD20G16B-MN" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAMD20G16B-AU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAMD20G16B-AN" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="105"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x10000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="CAL" start="0x00800000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="LOCKBIT" start="0x00802000" size="0x4" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP1" start="0x00806000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP2" start="0x00806008" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP4" start="0x00806020" size="0xE0" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="HRAMC0" start="0x20000000" size="0x2000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HPB0" start="0x40000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB2" start="0x42000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="samd20b/edc/ATSAMD20G16B.PIC"/>
                  <mchp:xc32 name="samd20b/xc32"/>
                  <mchp:hwtool type="mplab.nmmrs">
                     <mchp:file name="samd20b/hwtools/mplab/arm.32bit.NMMRs.xml"/>
                     <mchp:file name="samd20b/hwtools/mplab/avr.8bit.NMMRs.xml"/>
                     <mchp:file name="samd20b/hwtools/mplab/32bit.NMMRs.xml"/>
                     <mchp:file name="samd20b/hwtools/mplab/16bit.NMMRs.xml"/>
                     <mchp:file name="samd20b/hwtools/mplab/8bit.NMMRs.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.devicesupport">
                     <mchp:file name="samd20b/hwtools/mplab/mplab.deviceSupport"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="samd20b/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="samd20b/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="emu">
                     <mchp:file name="samd20b/hwtools/emu/RIDbgToolManager.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/Simulator.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/RI4ToolBase.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/PK3OBDbgToolManager.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/AtmelIceScriptingBase.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/PKOB4ToolImpl.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/PICkit3DbgToolManager.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/AtmelIceBase.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/SKDEManager.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/ICD4ToolBase.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/PICkit2DbgToolManager.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/SnapToolImpl.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/Pk4HybridTooImpl.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/PKOBSKDEDbgToolManager.emu"/>
                     <mchp:file name="samd20b/hwtools/emu/ICD3DbgToolManager.emu"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="tex">
                     <mchp:file name="samd20b/hwtools/tex/RIDbgToolManager.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/PKOBSKDEDbgToolManager.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/PICkit3DbgToolManager.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/PK3OBDbgToolManager.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/SnapToolImpl.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/PK4ToolBase.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/ICD3DbgToolManager.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/PKOB4ToolImpl.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/SKDEManager.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/AtmelIceScriptingBase.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/Pk4HybridTooImpl.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/PICkit2DbgToolManager.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/RI4ToolBase.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/PgmToolManager.toolMediator"/>
                     <mchp:file name="samd20b/hwtools/tex/ICD4ToolBase.toolMediator"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="samd20b/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="samd20b/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="samd20b/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="samd20b/hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="samd20b/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="samd20b/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="samd20b/hwtools/sdm/sdmRealICE4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="pkg">
                     <mchp:file name="samd20b/hwtools/pkg/pkg.pkg"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="pk4">
                     <mchp:file name="samd20b/hwtools/pk4/pk4.pk4"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="samd20b/hwtools/persfr/pic12.persfr"/>
                     <mchp:file name="samd20b/hwtools/persfr/avr8.persfr"/>
                     <mchp:file name="samd20b/hwtools/persfr/pic18.persfr"/>
                     <mchp:file name="samd20b/hwtools/persfr/arm32.persfr"/>
                     <mchp:file name="samd20b/hwtools/persfr/pic32.persfr"/>
                     <mchp:file name="samd20b/hwtools/persfr/pic16.persfr"/>
                     <mchp:file name="samd20b/hwtools/persfr/dspic.persfr"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="per">
                     <mchp:file name="samd20b/hwtools/per/avr8.per"/>
                     <mchp:file name="samd20b/hwtools/per/pic16.per"/>
                     <mchp:file name="samd20b/hwtools/per/pic18.per"/>
                     <mchp:file name="samd20b/hwtools/per/dspic.per"/>
                     <mchp:file name="samd20b/hwtools/per/armcm7.per"/>
                     <mchp:file name="samd20b/hwtools/per/pic32.per"/>
                     <mchp:file name="samd20b/hwtools/per/pic12.per"/>
                     <mchp:file name="samd20b/hwtools/per/usart.ispPeripheral.xml"/>
                     <mchp:file name="samd20b/hwtools/per/usart.plibgen.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="icd4">
                     <mchp:file name="samd20b/hwtools/icd4/icd4.icd4"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="ice4">
                     <mchp:file name="samd20b/hwtools/ice4/ice4.ice4"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAMD20G16B" title="Device page for ATSAMD20G16B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAMD20G16B" title="Datasheet"/>
         </device>
      </family>
   </devices>
   <conditions>
      <condition id="ARMCC">
         <accept Tcompiler="ARMCC"/>
      </condition>
      <condition id="ARMCC Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
      </condition>
      <condition id="GCC">
         <accept Tcompiler="GCC"/>
      </condition>
      <condition id="GCC Exe">
         <accept Tcompiler="GCC" Toutput="exe"/>
      </condition>
      <condition id="IAR">
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="IAR Exe">
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="C">
         <accept Tcompiler="ARMCC"/>
         <accept Tcompiler="GCC"/>
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="C Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
         <accept Tcompiler="GCC" Toutput="exe"/>
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="C Lib">
         <accept Tcompiler="ARMCC" Toutput="lib"/>
         <accept Tcompiler="GCC" Toutput="lib"/>
         <accept Tcompiler="IAR" Toutput="lib"/>
      </condition>
      <condition id="ATSAMD20E18">
         <require Dvendor="Microchip:3" Dname="ATSAMD20E18"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20E17">
         <require Dvendor="Microchip:3" Dname="ATSAMD20E17"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20E16">
         <require Dvendor="Microchip:3" Dname="ATSAMD20E16"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
