Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.3.56/Microchip.SAMD20_DFP.pdsc
      <condition id="ATSAMD20E15">
         <require Dvendor="Microchip:3" Dname="ATSAMD20E15"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20E14">
         <require Dvendor="Microchip:3" Dname="ATSAMD20E14"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G14B">
         <require Dvendor="Microchip:3" Dname="ATSAMD20G14B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20E15B">
         <require Dvendor="Microchip:3" Dname="ATSAMD20E15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G18">
         <require Dvendor="Microchip:3" Dname="ATSAMD20G18"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20E16BU">
         <require Dvendor="Microchip:3" Dname="ATSAMD20E16BU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G18U">
         <require Dvendor="Microchip:3" Dname="ATSAMD20G18U"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20E15BU">
         <require Dvendor="Microchip:3" Dname="ATSAMD20E15BU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G15">
         <require Dvendor="Microchip:3" Dname="ATSAMD20G15"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G14">
         <require Dvendor="Microchip:3" Dname="ATSAMD20G14"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G17">
         <require Dvendor="Microchip:3" Dname="ATSAMD20G17"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G16">
         <require Dvendor="Microchip:3" Dname="ATSAMD20G16"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G17U">
         <require Dvendor="Microchip:3" Dname="ATSAMD20G17U"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J15B">
         <require Dvendor="Microchip:3" Dname="ATSAMD20J15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J18">
         <require Dvendor="Microchip:3" Dname="ATSAMD20J18"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J16B">
         <require Dvendor="Microchip:3" Dname="ATSAMD20J16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20E16B">
         <require Dvendor="Microchip:3" Dname="ATSAMD20E16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G15B">
         <require Dvendor="Microchip:3" Dname="ATSAMD20G15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J14">
         <require Dvendor="Microchip:3" Dname="ATSAMD20J14"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J15">
         <require Dvendor="Microchip:3" Dname="ATSAMD20J15"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20E14B">
         <require Dvendor="Microchip:3" Dname="ATSAMD20E14B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J17">
         <require Dvendor="Microchip:3" Dname="ATSAMD20J17"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J16">
         <require Dvendor="Microchip:3" Dname="ATSAMD20J16"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20J14B">
         <require Dvendor="Microchip:3" Dname="ATSAMD20J14B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD20G16B">
         <require Dvendor="Microchip:3" Dname="ATSAMD20G16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20E18">
         <description>Headers and startup code for Microchip ATSAMD20E18</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/gcc/startup_samd20e18.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/system_samd20e18.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20/gcc/gcc/samd20e18_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20/gcc/gcc/samd20e18_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/armcc/startup_samd20e18.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/system_samd20e18.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/iar/startup_samd20e18.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/system_samd20e18.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20/iar/iar/samd20e18_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20/iar/iar/samd20e18_sram.icf" attr="config"/>
         </files>
      </component>
