Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.3.56/Microchip.SAMD20_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20E17">
         <description>Headers and startup code for Microchip ATSAMD20E17</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/gcc/startup_samd20e17.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/system_samd20e17.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20/gcc/gcc/samd20e17_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20/gcc/gcc/samd20e17_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/armcc/startup_samd20e17.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/system_samd20e17.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/iar/startup_samd20e17.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/system_samd20e17.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20/iar/iar/samd20e17_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20/iar/iar/samd20e17_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20E16">
         <description>Headers and startup code for Microchip ATSAMD20E16</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/gcc/startup_samd20e16.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/system_samd20e16.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20/gcc/gcc/samd20e16_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20/gcc/gcc/samd20e16_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/armcc/startup_samd20e16.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/system_samd20e16.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/iar/startup_samd20e16.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/system_samd20e16.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20/iar/iar/samd20e16_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20/iar/iar/samd20e16_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20E15">
         <description>Headers and startup code for Microchip ATSAMD20E15</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/gcc/startup_samd20e15.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/system_samd20e15.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20/gcc/gcc/samd20e15_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20/gcc/gcc/samd20e15_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/armcc/startup_samd20e15.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/system_samd20e15.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/iar/startup_samd20e15.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/system_samd20e15.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20/iar/iar/samd20e15_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20/iar/iar/samd20e15_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20E14">
         <description>Headers and startup code for Microchip ATSAMD20E14</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/gcc/startup_samd20e14.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/system_samd20e14.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20/gcc/gcc/samd20e14_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20/gcc/gcc/samd20e14_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/armcc/startup_samd20e14.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/system_samd20e14.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/iar/startup_samd20e14.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/system_samd20e14.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20/iar/iar/samd20e14_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20/iar/iar/samd20e14_sram.icf" attr="config"/>
         </files>
      </component>
