Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.3.56/Microchip.SAMD20_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20G14B">
         <description>Headers and startup code for Microchip ATSAMD20G14B</description>
         <files>
            <file condition="C" category="include" name="samd20b/include"/>
            <file condition="C" category="header" name="samd20b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20b/gcc/gcc/startup_samd20g14b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20b/gcc/system_samd20g14b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20b/gcc/gcc/samd20g14b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20b/gcc/gcc/samd20g14b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20b/armcc/armcc/startup_samd20g14b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20b/armcc/system_samd20g14b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20b/iar/iar/startup_samd20g14b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20b/iar/system_samd20g14b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20b/iar/iar/samd20g14b_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20b/iar/iar/samd20g14b_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20E15B">
         <description>Headers and startup code for Microchip ATSAMD20E15B</description>
         <files>
            <file condition="C" category="include" name="samd20b/include"/>
            <file condition="C" category="header" name="samd20b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20b/gcc/gcc/startup_samd20e15b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20b/gcc/system_samd20e15b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20b/gcc/gcc/samd20e15b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20b/gcc/gcc/samd20e15b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20b/armcc/armcc/startup_samd20e15b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20b/armcc/system_samd20e15b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20b/iar/iar/startup_samd20e15b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20b/iar/system_samd20e15b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20b/iar/iar/samd20e15b_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20b/iar/iar/samd20e15b_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20G18">
         <description>Headers and startup code for Microchip ATSAMD20G18</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/gcc/startup_samd20g18.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/system_samd20g18.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20/gcc/gcc/samd20g18_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20/gcc/gcc/samd20g18_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/armcc/startup_samd20g18.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/system_samd20g18.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/iar/startup_samd20g18.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/system_samd20g18.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20/iar/iar/samd20g18_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20/iar/iar/samd20g18_sram.icf" attr="config"/>
         </files>
      </component>
