Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.3.56/Microchip.SAMD20_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20J14">
         <description>Headers and startup code for Microchip ATSAMD20J14</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/gcc/startup_samd20j14.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/system_samd20j14.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20/gcc/gcc/samd20j14_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20/gcc/gcc/samd20j14_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/armcc/startup_samd20j14.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/system_samd20j14.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/iar/startup_samd20j14.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/system_samd20j14.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20/iar/iar/samd20j14_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20/iar/iar/samd20j14_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20J15">
         <description>Headers and startup code for Microchip ATSAMD20J15</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/gcc/startup_samd20j15.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/system_samd20j15.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20/gcc/gcc/samd20j15_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20/gcc/gcc/samd20j15_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/armcc/startup_samd20j15.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/system_samd20j15.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/iar/startup_samd20j15.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/system_samd20j15.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20/iar/iar/samd20j15_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20/iar/iar/samd20j15_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20E14B">
         <description>Headers and startup code for Microchip ATSAMD20E14B</description>
         <files>
            <file condition="C" category="include" name="samd20b/include"/>
            <file condition="C" category="header" name="samd20b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20b/gcc/gcc/startup_samd20e14b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20b/gcc/system_samd20e14b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20b/gcc/gcc/samd20e14b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20b/gcc/gcc/samd20e14b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20b/armcc/armcc/startup_samd20e14b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20b/armcc/system_samd20e14b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20b/iar/iar/startup_samd20e14b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20b/iar/system_samd20e14b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20b/iar/iar/samd20e14b_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20b/iar/iar/samd20e14b_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20J17">
         <description>Headers and startup code for Microchip ATSAMD20J17</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/gcc/startup_samd20j17.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/system_samd20j17.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20/gcc/gcc/samd20j17_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20/gcc/gcc/samd20j17_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/armcc/startup_samd20j17.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/system_samd20j17.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/iar/startup_samd20j17.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/system_samd20j17.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20/iar/iar/samd20j17_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20/iar/iar/samd20j17_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20J16">
         <description>Headers and startup code for Microchip ATSAMD20J16</description>
         <files>
            <file condition="C" category="include" name="samd20/include"/>
            <file condition="C" category="header" name="samd20/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/gcc/startup_samd20j16.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20/gcc/system_samd20j16.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20/gcc/gcc/samd20j16_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20/gcc/gcc/samd20j16_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/armcc/startup_samd20j16.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20/armcc/system_samd20j16.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/iar/startup_samd20j16.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20/iar/system_samd20j16.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20/iar/iar/samd20j16_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20/iar/iar/samd20j16_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20J14B">
         <description>Headers and startup code for Microchip ATSAMD20J14B</description>
         <files>
            <file condition="C" category="include" name="samd20b/include"/>
            <file condition="C" category="header" name="samd20b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20b/gcc/gcc/startup_samd20j14b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20b/gcc/system_samd20j14b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20b/gcc/gcc/samd20j14b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20b/gcc/gcc/samd20j14b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20b/armcc/armcc/startup_samd20j14b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20b/armcc/system_samd20j14b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20b/iar/iar/startup_samd20j14b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20b/iar/system_samd20j14b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20b/iar/iar/samd20j14b_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20b/iar/iar/samd20j14b_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.3.0" condition="ATSAMD20G16B">
         <description>Headers and startup code for Microchip ATSAMD20G16B</description>
         <files>
            <file condition="C" category="include" name="samd20b/include"/>
            <file condition="C" category="header" name="samd20b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd20b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd20b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd20b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd20b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd20b/gcc/gcc/startup_samd20g16b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd20b/gcc/system_samd20g16b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd20b/gcc/gcc/samd20g16b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd20b/gcc/gcc/samd20g16b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20b/armcc/armcc/startup_samd20g16b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd20b/armcc/system_samd20g16b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20b/iar/iar/startup_samd20g16b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd20b/iar/system_samd20g16b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd20b/iar/iar/samd20g16b_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd20b/iar/iar/samd20g16b_sram.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
